cv/cv.tex
% Created 2026-06-22 Mon 16:00
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper,10pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[en, english]{babel}
\usepackage{multicol}
\usepackage[a4paper, top=19mm, left=12.925mm, right=12.925mm, bottom=43mm]{geometry}
\usepackage{titlesec}
\usepackage{indentfirst}
\usepackage[skip=1pt, indent=10pt]{parskip}
\usepackage[inline]{enumitem}
\usepackage[dvipsnames]{xcolor}
\usepackage{fontawesome5}
\usepackage{fdsymbol}

\titleformat*{\section}{\normalfont\normalsize\centering\scshape}
\titlespacing*{\section}{0pt}{10pt}{5pt}
\setlist[itemize]{leftmargin=10pt}
\definecolor{x-acs-dark-red}{HTML}{CC0000}
\definecolor{x-acs-dark-blue}{HTML}{0033CC}
\pagenumbering{gobble}
\newcommand{\sep}{\textbf{|} }
\author{}
\date{}
\title{}
\hypersetup{
  colorlinks=true,
  linkcolor=x-acs-dark-blue,
  filecolor=x-acs-dark-blue,
  urlcolor=x-acs-dark-blue
}
\begin{document}

\section*{\Huge \bfseries \itshape Sidney Pedro de Jesus Silva Pinto}
\begin{center}
  \noindent
  {\color{x-acs-dark-red} \faIcon{map-marker-alt}} Rio Grande do Norte, Brazil \sep
  \href{mailto:sidneypepo@disroot.org}{{\color{x-acs-dark-red} \faIcon{envelope}} \texttt{sidneypepo@disroot.org}} \sep
  {\color{x-acs-dark-red} \faIcon{phone-alt}} +55 (84) XXXXX-XXXX

  % Optional vvvvv
  % Job title: Cybersecurity researcher
  % Credentials:

  \noindent
  \href{https://sidneypepo.com}{{\color{x-acs-dark-red} \faIcon{globe}} \texttt{sidneypepo.com}} \sep
  \href{https://www.linkedin.com/in/sidneypepo}{{\color{x-acs-dark-red} \faIcon{linkedin}} sidneypepo} \sep
  \href{https://github.com/sidneypepo}{{\color{x-acs-dark-red} \faIcon{github}} sidneypepo} \sep
  \href{https://www.youtube.com/@sidneypepo}{{\color{x-acs-dark-red} \faIcon{youtube}} sidneypepo} \sep
  \href{https://www.youtube.com/@sysb1n}{{\color{x-acs-dark-red} \faIcon{youtube}} sysb1n}

  \href{https://orcid.org/0009-0009-6648-1461}{{\color{x-acs-dark-red} \faIcon{orcid}} 0009-0009-6648-1461} \sep
  \href{https://www.researchgate.net/profile/Sidney-Pinto-2}{{\color{x-acs-dark-red} \faIcon{researchgate}} Sidney-Pinto-2} \sep
  \href{https://lattes.cnpq.br/1727009327749804}{{\color{x-acs-dark-red} \faIcon{graduation-cap}} 1727009327749804}

  \noindent{\color{x-acs-dark-red} \rule{\linewidth}{1pt}}
\end{center}

\setlength{\columnsep}{6.35mm}
\setlength{\columnseprule}{1pt}
\def\columnseprulecolor{\color{x-acs-dark-red}}
\begin{multicols*}{2}
\section*{\textbf{Summary}}
\label{sec:orga3d499d}
\textbf{Detail-oriented cybersecurity researcher with a strong ten-year background in
SecOps, focused on Purple Team operations, specialized in the investigation of
critical widely deployed computational entities. Experienced in collaborating to
complex projects by adopting the leading industry standards for continuous
evaluation, deployment and management of network systems and services. Proven
ability to mitigate threats, improve infrastructure resilience and investigate
barely known security measures up to chipset-level. Committed to solve problems
and lift up the quality baseline of results.}
\section*{Education}
\label{sec:org8a8e533}
\begin{itemize}
\item \textbf{2023-03 -- Present |} \emph{Instituto Federal de Educação, Ciência e Tecnologia do
RN} (IFRN) \textbf{|} Natal, Brazil

\textbf{Bachelor of Technology in Computer Systems Networking}
\begin{itemize}
\item Grade: 90.42.
\end{itemize}

\item \textbf{2020-02 -- 2021-07 |} \emph{Instituto Metrópole Digital} (IMD/UFRN) \textbf{|} Natal,
Brazil

\textbf{Associate's Degree in Computer Systems Networking}
\begin{itemize}
\item Grade: 84.57.
\end{itemize}
\end{itemize}
\section*{Work experience}
\label{sec:orgf28ff4e}
\begin{itemize}
\item \textbf{2024-01 -- Present |} \emph{LaTARC Research Lab} \textbf{|} Natal, Brazil

\textbf{SecOps \& Researcher}
\begin{itemize}
\item Conducted and collaborated to various research projects. Relevant subjects
are:
\begin{itemize}
\item Analysis and exploitation of kernel-space vulnerabilities.

\item Linux Kernel module development.

\item Bypass and escaping of Trusted Execution Environments.

\item Chipset-level firmware analysis and exploitation.

\item Baseband architectures and security measures.

\item Exploitation analysis at user-space vulnerabilities.

\item Security analysis of containerized environments and runtimes.
\end{itemize}

\item Bootstraped the Corisco datacenter servers with shift-left security and
incident response measures. Also setup the firewall, DNS and VPN core
services with modern, rock-solid, open-source frameworks.

\item Deployed, managed and hardened more than ten web applications developed in
Centro de Soluções Aplicadas (CSA), achieving immediate resistance against
cyber attacks and incidents.
\end{itemize}

\item \textbf{2019-08 -- 2021-07 |} \emph{GuardWeb} \textbf{|} Remote

\textbf{Course instructor}
\begin{itemize}
\item Taught a practical lock picking online course for Red Team operators, which
impacted dozens of careers of cybersecurity professionals.
\end{itemize}
\end{itemize}
\section*{Languages}
\label{sec:org994bd69}
\begin{center}
\begin{tabular}{l|l|c}
\textbf{Language} & \textbf{Proficiency} & \textbf{CEFR}\\
Portuguese & Native or bilingual & C2\\
English & Professional working & C1\\
Russian & Elementary & A1\\
Spanish & Elementary & A1\\
\end{tabular}
\end{center}
\section*{Skills}
\label{sec:orgccc8d4d}
\begin{itemize}
\item \textbf{Teamwork and collaboration}: communication, leadership, problem solving,
autonomy, project management, agile methodologies and frameworks, documenting
and reporting (Project Management Softwares, \LaTeX{} and office suites).

\item \textbf{SecOps}: systems administration, fine-tuning and hardening (Blue Team),
penetration testing (Red Team), basic pipeline and cloud (Azure and Oracle)
management, incident response, computer forensics, reverse engineering,
malware analysis.

\item \textbf{Programming and development}: assembly (x86/x86\_64 and ARMv8-A), C, Emacs
Lisp, Python, Ruby, Shell Script (bash and POSIX), VCS (Git), HTML5, CSS3,
JavaScript/TypeScript, SQL.

\item \textbf{Audiovisual}: image and video editing, illustration design, visual effects
and compositing, sound design.
\end{itemize}
\section*{Certifications}
\label{sec:org9b51ff4}
\noindent \textbf{2024-10 |} \emph{Especialização Red Team} \textbf{|} Hackers do Bem

\noindent \textbf{2024-01 |} \emph{CCNA: Introduction to Networks} \textbf{|} Cisco
Networking Academy

\noindent \textbf{2019-11 |} \emph{Google Cloud Certified in G Suite} \textbf{|} G Suite
\section*{Awards and honors}
\label{sec:org97642bd}
\noindent \textbf{2025-01 |} \emph{Engaged with Red Hat course content and
practiced hands-on labs} \textbf{|} Red Hat Academy

\noindent \textbf{2024-01 |} \emph{Graduated with score higher than 75\% on CCNA:
Introduction to Networks final exam} \textbf{|} Cisco Networking Academy

\noindent \textbf{2020-05 |} \emph{1st placed team at Maker Challenge from 1º
Hackathon Espacial: Combatendo a Covid-19} \textbf{|} Agência Espacial Brasileira (AEB)
\section*{Research papers}
\label{sec:orged00274}
\begin{itemize}
\item Journal articles
\begin{itemize}
\item \textbf{2026 |} \emph{SKTRC: Targeted and Persistent Linux Kernel Event Tracing for
Vulnerability Analysis}

\textbf{Under review}
\end{itemize}

\item Unpublished papers
\begin{itemize}
\item \textbf{2025 |} \emph{Análise de vulnerabilidades presentes nos mecanismos de segurança
dos chipsets Qualcomm de smartphones Android}

\textbf{Seminário de Orientação de Projeto Integrador 2025.1 -- IFRN}

\item \textbf{2025 |} \emph{Plataforma de baixo custo baseada em smartphones Android para
análise e exploração de vulnerabilidades em redes móveis LTE}

\textbf{Seminário de Orientação à Prática Profissional 2025.1 -- IFRN}

\item \textbf{2024 |} \emph{State of the Art and Taxonomy of Security Scanners for Protecting
Containerized Systems}

\textbf{Unpublished}

\item \textbf{2024 |} \emph{Plataformas para análise e exploração de vulnerabilidades em redes
móveis LTE}

\textbf{Metodologia Científica e Tecnológica 2024.1 -- IFRN}
\end{itemize}
\end{itemize}
\section*{Volunteer work}
\label{sec:orgfaf789a}
\begin{itemize}
\item \textbf{2026-05 |} \emph{DevOpsDays Natal 2026} \textbf{|} Natal, Brazil

\textbf{Staff member}
\begin{itemize}
\item Responsible for the audio management and mixing during the event.
\end{itemize}

\item \textbf{2025-10 |} \emph{Reid Morrison's IOStreams} \textbf{|} Remote

\textbf{Contributor}
\begin{itemize}
\item Added support to PGP Elliptic Curve key generation.

\item Enabled PGP passphrase-less key generation.
\end{itemize}

\item \textbf{2025-04 -- 2025-05 |} \emph{Bjoern Kerler's EDL} \textbf{|} Remote

\textbf{Contributor}
\begin{itemize}
\item Created and documented the EDL API for automating low-level EDL tasks.

\item Fixed the PBL/BootROM extractor for non-standard devices.

\item Improved installation scripts and documentation to support POSIX-compliant
operating systems.

\item Patched a dependency incompatibility with modern GCC.

\item Added Firehose programmers for two new devices.
\end{itemize}

\item \textbf{2024-10 |} \emph{ENCOM 2024 -- XIV Conferência Nacional em Comunicações, Redes e
Segurança da Informação} \textbf{|} Natal, Brazil

\textbf{Staff member}
\begin{itemize}
\item Responsible for guiding the listeners to the talk spaces during the event.
\end{itemize}

\item \textbf{2019-03 -- 2021-02 |} \emph{Programa Aluno Tutor de Tecnologia Google} \textbf{|} Natal,
Brazil

\textbf{Technology tutor}
\begin{itemize}
\item Taught and assisted students and teachers on the usage of technologies for
academic purposes, with special focus to the G Suite for Education platform.
\end{itemize}

\item \textbf{2017-11 |} \emph{Palestra: Segurança da Informação} \textbf{|} Natal, Brazil

\textbf{Speaker}
\begin{itemize}
\item Organized and presented a talk about the essentials of information security
for middle school students.
\end{itemize}

\item \textbf{2015-07 -- Present |} \emph{YouTube} \textbf{|} Remote

\textbf{Content creator}
\begin{itemize}
\item Engaged in producing free educational content, including lectures, guides
and tutorials, around diverse subjects, often related to introductory
computational topics.
\end{itemize}
\end{itemize}
\section*{References}
\label{sec:org478533a}
Available upon request.

\end{multicols*}
\end{document}
